#მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ მათი ჯამი. გატესტეთ კოდი და მოიძიეთ ინფორმაცია, თუ რატომ არ დაიბეჭდა სასურველი შედეგი და როგორ შეიძლება ამ პრობლემის
#  მოგვარება.(რიცხვების ჯამი არ გამოვა, ისინი უბრალოდ ერთმანეთს მიეწებებიან)
'''
num1 = input("შეიყვანე პირველი რიცხვი:")
num2 = input("შეიყვანე მეორე რიცხვი:")
print("საბოლოო ჯამი", num1 +num2 )
'''
#ეს არ არის ჯამი, ეს არის „კონკატენაცია“ ანუ ტექსტების მიერთება.

#ჩვენ გვწირდება int(integer-ი) რადგან თუ ინტეგერის გარეშე გავაკეთეთ კომპიუტერი კოდს წაიკიტხავს string-ად, ხოლო თუ დავამატებთ int-ს იგი უკვე გადაიყვანს მთლიან რიცხვად.

num1 = int(input("შეიყვანე პირველი რიცხვი:"))
num2 = int(input("შეიყვვანე მეორე რიცხვი:"))
print("საბოლოო ჯამი", num1 + num2)