'''
2) შექმენით 2 ცვლადი, ერთში შეინახეთ თქვენი სახელი, მეორეში ასაკი.(ასაკი უნდა იყოს შენახული როგორც integer-ი)

ამ ცვლადების გამოყენებით შექმენით წინადადება, მაგალითად:

"My name is {name}. I'm {age} years old."

ამ დავალების შესრულებაში დაგჭირდებათ რომელიღაც ცვლადისთვის მონაცემთა ტიპის შეცვლა, რომ მოახდინოთ კონკადინაცია.
'''
'''
my_name=("dato")
my_age=18

sentence=("my name is " + my_name + "i'm " + my_age + "years old")
'''
#ეს არ გამოვა რადგან my_age არის int, ამიტომაც ტუ გვინდა რომ ეს გამოგვივიდეს my_age უნდა გადავიყვანოტ strng-ად.\
my_name=("dato")
my_age=18

sentence=("my name is " + my_name +"."  +  "i'm " + str(my_age) + "years old")
print(sentence)