'''მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი არის 10-ზე დაბეჭდეთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს}
 არის 10-ზე ნაკლები", სხვა შემთხევევაში თუ 20-ზე ნაკლებია დაბეჭდავთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს} არის 20-ზე ნაკლები"

ამისთვის დაგჭირდებათ if/elif

2) მომხარებელს შემოატანინეთ რიცხვი და თუ ის არის ლუწი დაბეჭდეთ "The number is even", სხვა შემთხვევაში დაბეჭდეთ "The number is odd"

3) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "წვიმიანი",
  დაბეჭდეთ "ვივარჯიშებ გარეთ", ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "არ ვივარჯიშებ დღეს"'''

number = int(input("შეიყვანეთ რიცხვი: "))

if number < 10:
    print(str(number) + " არის 10-ზე ნაკლები")
elif number < 20:
    print(str(number) + " არის 20-ზე ნაკლები")





number = int(input("შეიყვანეთ რიცხვი: "))

if number % 2 == 0:
    print("The number is even")
else:
    print("The number is odd")



weather = input("შეიყვანეთ ამინდი: ")

if weather == "მზიანი":
    print("ვივარჯიშებ გარეთ")
elif weather == "წვიმიანი":
    print("ვივარჯიშებ გარეთ")
else:
    print("არ ვივარჯიშებ დღეს")

    '''მომხმარებელს შემოატანინეთ 3 სახელი და უბბრალოდ დაბეჭდეთ ის.

ამ დავალების შესასრულებლად გამოიყენეთ for loop-ი(for ციკლი)'''

for i in range(3):
    name = input("შეიყვანეთ სახელი: ")
    print(name)