#კომენტარებით ახსენით რას აკეთებენ int, str და float ფუნქციები. თითოეულზე გააკეთეთ 3-3 მაგალითი.

'''int ფუნქციით შეგვიძლია რაიმე მონაცემი გადავაქციოც მთელ რიცხვად რომელიც გამოიყენება მათემატიკურ მოქმედებებში.
1)num1 = input("შეიყვანე რიცხვი: ")
num1 = int(num1)

2)x=int(3.6)

3)num=int(input("input number))
print(num+5)

str ფინქციით შეგვიძლია ნებისმიერი რამე გადავაქციოთ string-ად ანუ ტექსტად


1)x=15
text=str(x)
print("რიცხვია: " + text)


2)my_age=17
text=str(my_age)
print(მე ვარ + text + წლის)

x=13
text=str(x)
print("საყვარელი რიცხვი" + text)

float ფუნქციიტ შეგვიძლია რაიმე რიცხვი გადავაქციოთ წილად რიცხვად \
1)x = float(10)

2)y = float("5.75")

3)z = float(True)

'''














