#კომენტარებით ახსენით რა არის string-ი, integer-ი და float-ი და ჩამოწერეთ მათი მაგალითები.
#string-ს ვიყენებთ ტექსტის დასაწერად მაგალითად "hello" ანუ კომპიუტერს უნდა მივცეთ ინსტრუქცია რომ სტრინგით დაწეროს და ამიტომაც ჩავსვავთ ბრჭყალებში ""
#integer-ი არის რივცხვითი მონაცემთა ტიპი, რაც ნიშნავს მთელ რიცხვს 10, 234, 1293
#floiat-უ ესეც რიცხვითი მონაცემთა ტიპია მაგრამ ეს აღნიშნავს ათწილადებს. 2.0,  5.0,  3.6,







#მოიძიეთ თუ რა განსხვავებაა print(5 + 5)-სა და print("5" + "5")-ს შორის და ახსენით კომენტარებით
print(5 + 5)
print("5" + "5")
# განსხვავება ისაა რომ პირველი intiger-ია ამიტომაც მატემატიკურად კრიბვავს და მეორეს რახან ბრჭყალები აქვს string-ად თვლის და გვერდიგვრედ აყენებს 55.