''' შექმენით Guess number თამაში:

შექმენით ცვლადი და შეინახეთ მასში 1-დან 10-ის ჩათვლით რიცხვი(ეს იქნება ჩაფიქრებული რიცხვი). მომხმარებელს იქამდე შემოატანინეთ რიცხვი,
 სანამ არ გამოიცნობს ჩაფიქრებულს. ყოველ არასწორად შეყვანილ რიცხვზე დაბეჭდეთ "Wrong number",
 ხოლო თუ მომხმარებელმა სწორად გამოიცნო რიცხვი, გათიშეთ while ციკლი და დაბეჭდეთ "You Win!"'''

number = 9

while True:
    guess=int(input("guess number:"))

    if guess== number:
       print("you winn!!!")
       break
    else:
       print("try again")


